ERP.belugaerp/src/Catalogs/бг_СостоянияОплатыАванса/бг_СостоянияОплатыАванса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>бг_СостоянияОплатыАванса</name>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.бг_СтатусыНачисленияАвансов</types>
    </type>
  </attributes>
  <attributes>
    <name>НалоговаяСтавка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродажаНаЭкспорт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ERP.belugaerp/src/Enums/бг_СтатусыНачисленияАвансов/бг_СтатусыНачисленияАвансов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>бг_СтатусыНачисленияАвансов</name>
  <enumValues>
    <name>НачисленАванс</name>
  </enumValues>
  <enumValues>
    <name>ОформленВычет</name>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Catalogs/бг_СостоянияОплатыАванса/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция СостояниеОплатыАванса(Период, Статус, НалоговаяСтавка = 0, ПродажаНаЭкспорт = Ложь) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СостоянияОплатыАванса.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.бг_СостоянияОплатыАванса КАК СостоянияОплатыАванса
	|ГДЕ
	|	СостоянияОплатыАванса.Статус = &Статус
	|	И СостоянияОплатыАванса.НалоговаяСтавка = &НалоговаяСтавка
	|	И СостоянияОплатыАванса.ПродажаНаЭкспорт = &ПродажаНаЭкспорт
	|	И СостоянияОплатыАванса.Период = &Период
	|	И НЕ СостоянияОплатыАванса.ПометкаУдаления";
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Статус", Статус);
	Запрос.УстановитьПараметр("НалоговаяСтавка", НалоговаяСтавка);
	Запрос.УстановитьПараметр("ПродажаНаЭкспорт", ПродажаНаЭкспорт);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	СостояниеОплатыАванса = Справочники.бг_СостоянияОплатыАванса.СоздатьЭлемент();
	СостояниеОплатыАванса.Статус = Статус;
	СостояниеОплатыАванса.Период = Период;
	СостояниеОплатыАванса.НалоговаяСтавка = НалоговаяСтавка;
	СостояниеОплатыАванса.Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
	СостояниеОплатыАванса.ПродажаНаЭкспорт = ПродажаНаЭкспорт;
	СостояниеОплатыАванса.Записать();
	
	Возврат СостояниеОплатыАванса.Ссылка;
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Статус");
	Поля.Добавить("НалоговаяСтавка");
	Поля.Добавить("Валюта");
	Поля.Добавить("ПродажаНаЭкспорт");
	Поля.Добавить("Период");
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если Данные.Статус = Перечисления.бг_СтатусыНачисленияАвансов.НачисленАванс Тогда
		Шаблон = НСтр("ru = '%1 %2 (ставка %3 %4)%5'");
	Иначе
		Шаблон = НСтр("ru = '%2 (аванс %1 ставка %3 %4 %5)'");
	КонецЕсли;
	
	Представление = СтрШаблон(
			Шаблон,
			Формат(Данные.Период, "ДФ=MM.yyyy"),
			Данные.Статус,
			Формат(Данные.НалоговаяСтавка, "ЧДЦ=2"),
			Данные.Валюта,
			?(Данные.ПродажаНаЭкспорт, НСтр("ru = ' экспорт'"), ""));
КонецПроцедуры

#КонецОбласти

#КонецЕсли
